Table of Contents
 Class Reinforcement
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Base class representing reinforcement in IDEA StatiCa Detail
public abstract class Reinforcement : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Reinforcement
Derived
Hanging
HangingAroundPatch
ReinfFabric
ReinforcementGroup
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Material
Material
public ReferenceElement Material { get; set; }
Property Value
ReferenceElement
 ReinfId
Id representing reinforcement in Detail
public int ReinfId { get; set; }
Property Value
int
 Edit this page